config-org/org.org
#+TITLE: Org Mode
#+PROPERTY: header-args      :tangle "../config-elisp/org.el"
* Require Org Mode
#+BEGIN_SRC emacs-lisp
(use-package org
  :config (setq org-startup-folded 'content))
#+END_SRC
* C-return to Fold
#+BEGIN_SRC emacs-lisp
(define-key org-mode-map (kbd "<C-return>") 'org-cycle)
#+END_SRC
* C-tab for other-window
#+BEGIN_SRC emacs-lisp
(define-key org-mode-map (kbd "<C-tab>") 'nil)
#+END_SRC
* Drag Stuff and org-metaup/down
#+BEGIN_SRC emacs-lisp
(defun org-move-lines()
  (define-key org-mode-map (kbd "M-p") 'org-metaup)
  (define-key org-mode-map (kbd "M-P") 'drag-stuff-up)
  (define-key org-mode-map (kbd "M-n") 'org-metadown)
  (define-key org-mode-map (kbd "M-N") 'drag-stuff-down))
(add-hook 'org-mode-hook 'org-move-lines)
#+END_SRC
* Expand Region
#+BEGIN_SRC emacs-lisp
(define-key org-mode-map (kbd "S-TAB") 'my/expand-region)
#+END_SRC
* Hungry Delete
#+BEGIN_SRC emacs-lisp
(add-hook 'org-mode-hook (lambda () (interactive) (hungry-delete-mode)))
#+END_SRC
* Kill Line
#+BEGIN_SRC emacs-lisp
(define-key org-mode-map (kbd "C-k") (lambda ()
               (interactive)
               (org-beginning-of-line)
               (org-kill-line)
               (org-kill-line)))
#+END_SRC
* Line Wrap
#+BEGIN_SRC emacs-lisp
(add-hook 'org-mode-hook (lambda () (interactive) (setq-local truncate-lines -1)))
#+END_SRC
* M-return for New Bullet Item
#+BEGIN_SRC emacs-lisp
(define-key org-mode-map (kbd "M-RET") (lambda()
                                              (interactive)
                                              (org-beginning-of-line)
                                              (org-meta-return)
                                              (org-metadown)))
#+END_SRC**
* Open Line Below
#+BEGIN_SRC emacs-lisp
(define-key org-mode-map [(shift return)] 'crux-smart-open-line)
#+END_SRC
* Org Mode Bullets
#+BEGIN_SRC emacs-lisp
(use-package org-bullets
  :ensure t
  :hook ((org-mode . org-bullets-mode))
  :config (setq-default org-ellipsis " ▸"))
#+END_SRC
* Org Mode Status Settings
#+BEGIN_SRC emacs-lisp
(setq org-todo-keyword-faces
      '(("Waiting" . (:foreground "tomato1" :weight bold))
        ("To Do" . (:foreground "dark khaki" :weight bold))
        ("In Progress" . (:foreground "DodgerBlue2" :weight bold))
        ("Done" . (:foreground "forest green" :weight bold))))
(setq org-todo-keywords
        '((sequence "To Do" "In Progress" "Done" "Waiting")))
#+END_SRC
* Org Open at Point
#+BEGIN_SRC emacs-lisp
(define-key org-mode-map (kbd "<s-return>") 'org-open-at-point)
#+END_SRC
* Org Open Line
#+BEGIN_SRC emacs-lisp
(define-key org-mode-map (kbd "C-o") (lambda()
                                       (interactive)
                                       (org-beginning-of-line)
                                       (org-open-line 1)))
#+END_SRC
* Org Up Element
#+BEGIN_SRC emacs-lisp
(define-key org-mode-map (kbd "C-s-p") 'org-up-element)
#+END_SRC
* Select Line and Copy
#+BEGIN_SRC emacs-lisp
(define-key org-mode-map (kbd "C-,") (lambda ()
               (interactive)
               (org-beginning-of-line)
               (set-mark-command nil)
               (org-end-of-line)
               (copy-keep-highlight (region-beginning) (region-end))))
#+END_SRC
